# Модуль 0. Введение в курс
# Модуль 1.1. Знакомство с системой персонального компьютера
# Задание 1
# ■ Изучить веб-интерфейс Сетевой академии Cisco. 
# Подготовка IT-профессионалов будущего
# Сетевая академия Cisco – программа профессионального и карьерного развития в сфере ИТ, пример взаимовыгодного сотрудничества между ИТ-индустрией и учебными заведениями. 
# Основываясь на опыте Cisco как мирового лидера в области информационных технологий, мы предлагаем курсы по сетевым технологиям, кибербезопасности, IoT, операционным системам и программированию. 
# Категории обучения с сайта, (которые сейчас не доступны):
# Introduction to Data Science 
# Networking Basics
# Python Essentials 1 
# Introduction to Cybersecurity
# Introduction to Internet of Things
# LinuxEvents
# ■ Познакомиться с предоставляемыми учебными ресурсами.
# ■ Изучить интерфейс внутри учебного курса.
# ■ Пройти предварительный тест. 


# // извините, а что сделать делать?