# Задание 1
# Показать на экран все простые числа в диапазоне,
# указанном пользователем. Число называется простым,
# если оно делится без остатка только на себя и на единицу.
s = int(input("Start"))  
e = int(input("End"))  

def is_prime(a):
    if a % 2 == 0:
        return a == 2
    d = 3
    while d * d <= a and a % d != 0:
        d += 2
    return d * d > a
print( [ '{} - True'.format(i) for i in range(s,e)  if is_prime(i)]) 

# Задание 2
for i in range(1, 10): 
    print("\n")
    for j in range(1, 10):
        print(i, " * ", j, " = ", i*j) 
   
# Задание 3
# Показать на экран таблицу умножения в диапазоне,
# указанном пользователем. Например, если пользователь
# указал 3 и 5, таблица может выглядеть так
# 3*1 = 3 3*2 = 6 3*3 = 9 ... 3 * 10 = 30
# .....................................................................................
# 5*1 = 5 5 *2 = 10 5 *3 = 15 ... 5 * 10 = 50 
s = int(input("Start"))  
e = int(input("End"))  


for i in range(s, e): 
    print("\n")
    for j in range(s, e):
        print(i, " * ", j, " = ", i*j) 