# 1 задание на подбор накоптеля 
# - SSD-накопитель на 120 ГБ (цена около 2500 рублей) - повышает скорость загрузки ОС и приложений;
# - Опционально: внешний HDD для резервного копирования данных (цена около 4000 рублей).

# Игровой ПК:
# - SSD-накопитель на 1Т (цена около 8000 рублей) - обеспечивает высокую скорость загрузки игр и приложений;

# Сервер:
# - SSD-накопитель на 1 ТБ (цена около 15000 рублей) - обеспечивает высокую скорость доступа к данным;
# - HDD 4 ТБ (цена около 10000 рублей) - для дополнительного хранения данных;
 


# 2 задание на магичснкий квадрат
a = int(input())  
Matrix = [[0 for x in range(a)] for y in range(a)]  
from random import randint
Matrix = [[randint(1, 10) for j in range(a)] for i in range(a)] 



for i in range(a):
    for j in range(a): 
       if Matrix[i][j]

