# Задание 1
# Пользователь вводит с клавиатуры три числа. Необходимо найти сумму чисел, произведение чисел. Результат
# вычислений вывести на экран.
n = int(input("1st number"))
n1 = int(input("2nd number"))
n2 = int(input("3rd number")) 

print("Sum", n+n1+n2, "Proiz", n*n1*n2 ) 
# Задание 2
# Пользователь вводит с клавиатуры три числа. Первое
# число — зарплата за месяц, второе число — сумма месячного платежа по кредиту в банке, третье число — задолженность за коммунальные услуги. Необходимо вывести
# на экран сумму, которая останется у пользователя после
# всех выплат. 
print("Trindec", n-n1-n2)
# Задание 3
# Напишите программу, вычисляющую площадь ромба. Пользователь с клавиатуры вводит длину двух его
# диагоналей. 
print("Square = ", n*n1)
# Задание 4
# Выведите на экран надпись To be or not to be на разных
# строках. Пример вывода:
# To be
# or not
# to be 
print("To be  \n or not \n to be")
# Домашнее задание
# 1
# Задание 5
# Выведите на экран надпись «Life is what happens when
# you're busy making other plans» John Lennon на разных
# строках. Пример вывода:
# “Life is what happens
#  when
#  you’re busy making other plans”
#  John Lennon. 
print("“Life is what happens \n\t when \n\t\t you’re busy making other plans” \n\t\t\t John Lennon.")