# 1. 
#  сервисный Центр KNOPIK  

# Есть возможность получить обучение с дальнейшим трудоустройством в Ответственный Сервис.

# Обязанности:

# • Выполнение блочного ремонта смартфонов и планшетов;
# • Обслуживание клиентов – консультирование по услугам и статусам заказов, а также условиям договора, продажи сопутствующих товаров, прием и выдача устройств;
# • Работа с кассой - проведение наличных и безналичных расчетов;
# • Соблюдение корпоративных стандартов.

# Требования:
# • Образование – среднее специальное; высшее; без образования
# • Опыт работы – без опыта работы/ или работа в сервисном центре или магазине электроники. Приветствуются компетенции в блочном ремонте смартфонов и планшетов;
# • Личные качества – коммуникабельность, ответственность, аккуратность, вежливость.

# Условия:

# • Зарплата: сдельная (от объема выполненных ремонтов) + премия от продаж сопутствующих
# товаров + ежеквартальная премия; Есть минимальная ставка от 1800 руб/день. И планомерное повышение зарплаты с ростом компетенций.
# • Обеспечение клиентским потоком (от 4 заказов в день);
# • Комфортные условия работы, полный набор современного оборудования и запчастей;
# • !Обучение за счет компании, возможен карьерный рост и расширение компетенций;
# • График работы сменный, гибкий 2/2 или 3/3 с 10.00 до 21.00. 



# 2. МКУ ОГПП
# Ведущий инженер по ремонту
# от 31 300 руб. до вычета налогов
# Требуемый опыт работы: не требуется

# Частичная занятость, сменный график

# Средняя годовая заработная плата в месяц 49300 рублей.

# Условия:

# сменный график работы 2/2 с 7:00 до 21:00;
# материальная помощь к ежегодному отпуску – 32660 рублей;
# ежеквартальная премия 46000 рублей;
# своевременная выплата заработной платы (2 раза в месяц)
# возможность профессионального и карьерного роста;
# обучение;
# официальное трудоустройство,
# работа в дружном, молодом и сплоченном коллективе;
# полный социальный пакет (предоставление ежегодного отпуска, оплата больничных листов).
# Обязанности:

# техническое обслуживание паркоматов, платежных терминалов, ремонт компьютеров, настройки сети.
# следит за пополнением резерва комплектующих для ремонта;

# Требования:

# высшее образование / неполное высшее(при обучении в данный момент);
# знания EXCEL, WORD
# опыт установки и настройки различного ПО;
# готовность к разъездной работе;
# аккуратность‚ пунктуальность, исполнительность. 

# 3. Сити Лаб 
# Обязанности:
# Администрирование парка компьютеров (около 90) и серверов (5) на базе ОС Windows;
# Сопровождение программно-аппаратной АТС Infinity 4;
# Разработка и внедрение различных инструкций и регламентов;
# Обучение сотрудников;
# Составление спецификаций для закупки оборудования, работа с поставщиками и провайдерами связи, контроль оплаты;
# Внедрение и ведение проектов по автоматизации бизнес процессов;
# Подключение медицинских анализаторов к СЛИС "Infomed". Сопровождение данной CЛИС;
# Сопровождение СКУД Орион.
# Требования:
# Высшее техническое образование;
# Опыт технического обслуживания и ремонта персональных компьютеров и оргтехники;
# Знание основы локальных сетей (стек протоколов TCP/IP, сетевое оборудование, принципы построения локальных вычислительных сетей).
# Условия:
# Оформление согласно ТК РФ;
# Уровень заработной платы по результатам собеседования. 

# Я бы не хотела работать в сити лаб из-за неявно обговоренных условий и большой нагрузке на 1 человека. Наверное, первый вариант, в связи с тем, 
# что там может работать студент