# Задание 1
# Найти сравнительные тесты и выполнить анализ двух
# топовых видеокарт от Nvidia и AMD. 

#         GeForce RTX 4090 и Radeon RX 7900 XTX

# Архитектура	     Ada Lovelace	     RDNA 3
# Граф процессор	AD102-300-A1	Navi 31 XTX
# Цена на момент выхода	1,599$	999$
# Цена сейчас	2318$       1.4x   1333$ 
# Соотношение цена-качество
# Отношение производительности к цене. Чем выше, тем лучше.

# Количество потоковых процессоров	16384	6144
# Частота ядра	2235 МГц	нет данных
# Частота в режиме Boost	2520 МГц	2270 МГц
# Количество транзисторов	76,300 млн	57,700 млн
# Технологический процесс	4 нм	5 нм
# Энергопотребление (TDP)	450 Вт	355 Вт
# Скорость текстурирования	1,290	959.6 

# Интерфейс	PCIe 4.0 x16	PCIe 4.0 x16
# Тип памяти	GDDR6X	GDDR6
# Максимальный объём памяти	24 Гб	24 Гб
# Ширина шины памяти	384 бит	384 бит
# Частота памяти	21000 МГц	20000 МГц
# Пропускная способность памяти	1,008 Гб/с	960.0 Гб/с

# Задание 2
# Подобрать видеокарту, монитор и звуковую карту с акустической системой для 3-х конфигураций:
# Бюджетный ПК:

# - Монитор: AOC 22E1H 21.5" Full HD 1920x1080 Monitor
#   - Цена: 7 500 рублей
#   - Характеристики: 21,5-дюймовый экран, разрешение 1920x1080, время отклика 5 мс, яркость 200 кд/м²
#   - Причина выбора: этот монитор является одним из самых доступных на рынке и подойдет для простых задач.

# - Звуковая карта: ASUS Xonar SE 5.1
#   - Цена: 4 500 рублей
#   - Характеристики: 5.1 каналов, 192 кГц/24 бит, поддержка Dolby Digital Live, панель управления включена в комплект
#   - Причина выбора: эта звуковая карта является одной из самых доступных на рынке и подойдет для прослушивания музыки и просмотра видео.

# Игровой ПК:

# - Видеокарта: NVIDIA GeForce RTX 3080
#   - Цена: 60 000 рублей
#   - Характеристики: 10 ГБ GDDR6X, базовая частота 1440 МГц, поддержка DirectX 12 Ultimate и Vulkan RT
#   - Причина выбора: это одна из самых мощных видеокарт на рынке из относительно досьупных обычным людям с отличными показателями, 
# которая обеспечивает высокую производительность в играх с высокими настройками графики.

# - Монитор: ASUS ROG Swift PG279QZ 27” Gaming Monitor, 1440P WQHD (2560 x 1440), IPS, 165Hz
#   - Цена: 50 000 рублей
#   - Характеристики: 27-дюймовый экран, разрешение 2560x1440, время отклика 4 мс, яркость 350 кд/м²
#   - Причина выбора: этот монитор обеспечивает высокую частоту обновления экрана и является идеальным выбором для игроков.

# - Звуковая карта: Creative Sound Blaster Z PCIe 116dB SNR Gaming Sound Card
#   - Цена: 10 000 рублей
#   - Характеристики: 5.1 каналов, 116 дБ SNR, поддержка Dolby Digital Live и DTS Connect
#   - Причина выбора: эта звуковая карта обеспечивает высокое качество звука и подойдет для игроков, которые ценят качество звука в играх.

# ПК для профессиональной обработки видео и звука:

# - Видеокарта: NVIDIA GeForce RTX 3080 Ti
#   - Цена: 120 000 рублей
# - Причина выбора: это одна из самых мощных видеокарт для профессиональной обработки видео и звука, которая обеспечивает быстрое рендеринг и высокую производительность.

# - Монитор: MSI Summit MS321UP
# - Цена: 80 000 рублей
#   - Характеристики: Быстродействующая матрица с диагональю 32", нативным разрешением 4К, частотой обновления кадров 60 Гц и временем отклика 4 мс;
# Источник: https://ratingpc.ru/luchshih-monitorov-dlya-videomontazha-reyting
#   - Причина выбора: этот монитор обеспечивает высокое качество изображения и является идеальным выбором для профессиональной обработки видео и звука.

# - Звуковая карта: Focusrite Scarlett 18i20 (2nd Gen) USB Audio Interface with Pro Tools | First
#   - Цена: 40 000 рублей
#   - Характеристики: 18 входов/20 выходов, 8 микрофонных предусилителей, поддержка Pro Tools | First и Ableton Live Lite
#   - Причина выбора: эта звуковая карта обеспечивает высокое качество звука и много входов/выходов, что делает ее идеальным выбором для профессиональной обработки звука и музыки.
# Обосновать необходимость либо отсутствие необходимости в том или ином компоненте для каждой из конфигураций.