# Задание 1
# Найти сравнительные тесты и выполнить анализ двух
# топовых видеокарт от Nvidia и AMD. 

#         GeForce RTX 4090 и Radeon RX 7900 XTX

# Архитектура	     Ada Lovelace	     RDNA 3
# Граф процессор	AD102-300-A1	Navi 31 XTX
# Цена на момент выхода	1,599$	999$
# Цена сейчас	2318$       1.4x   1333$ 
# Соотношение цена-качество
# Отношение производительности к цене. Чем выше, тем лучше.

# Количество потоковых процессоров	16384	6144
# Частота ядра	2235 МГц	нет данных
# Частота в режиме Boost	2520 МГц	2270 МГц
# Количество транзисторов	76,300 млн	57,700 млн
# Технологический процесс	4 нм	5 нм
# Энергопотребление (TDP)	450 Вт	355 Вт
# Скорость текстурирования	1,290	959.6 

# Интерфейс	PCIe 4.0 x16	PCIe 4.0 x16
# Тип памяти	GDDR6X	GDDR6
# Максимальный объём памяти	24 Гб	24 Гб
# Ширина шины памяти	384 бит	384 бит
# Частота памяти	21000 МГц	20000 МГц
# Пропускная способность памяти	1,008 Гб/с	960.0 Гб/с

# Задание 2
# Подобрать видеокарту, монитор и звуковую карту с акустической системой для 3-х конфигураций:
# ■ бюджетный ПК;
# ■ игровой ПК;
# ■ ПК для профессиональной обработки видео и звука.
# Обосновать необходимость либо отсутствие необходимости в том или ином компоненте для каждой из конфигураций.